# 股票数据下载配置示例

# 常用的中国A股
A_STOCKS = {
    # 算力供电
    # "002335": "科华数据",
    # "002364": "中恒电气",
    # "300617": "安靠智电",
    # "688226": "威腾电气",
    # "688676": "金盘科技",
    # "002518": "科士达",
    # # 电网调度/算电大脑
    # "600406": "国电南瑞",
    # "301638": "南网数字",
    # "601126": "四方股份",
    # "600131": "国网信通",
    # "000682": "东方电子",
    # 绿电直供/算电一体化
    "002015": "协鑫能科",
    # "001896": "豫能控股",
    # "600821": "金开新能",
    # "601868": "中国能建",
    # "002929": "润建股份",
    # "300490": "华自科技",
    # # 温控节能/配套服务
    # "002837": "英维克",
    # "300442": "润泽科技",
    # "600452": "涪陵电力"
}
# 热门美股
US_STOCKS = {
    "AAPL": "苹果",
    "MSFT": "微软",
    "GOOGL": "谷歌",
    "TSLA": "特斯拉",
    "NVDA": "英伟达",
    "META": "Meta"
}

# 港股
HK_STOCKS = {
    "09988": "阿里巴巴",
    "00700": "腾讯",
    "03690": "美团",
    "09999": "网易"
}

# 数据周期说明
PERIODS = {
    "1min": "1分钟K线",
    "5min": "5分钟K线", 
    "15min": "15分钟K线",
    "30min": "30分钟K线",
    "60min": "1小时K线",
    "1day": "日K线",
    "1week": "周K线",
    "1month": "月K线"
}